docs/build-log/comms-matrix-1/fixback-2/Patient-version-mutation.diff
--- a/mcp/tests/commsApi.test.ts
+++ b/mcp/tests/commsApi.test.ts
@@ -2291,3 +2291,3 @@
             id,
-            meta: { ...resource.meta, versionId: String(Number(currentVersion ?? "0") + 1) },
+            meta: { ...resource.meta, versionId: "1" },
           } as T;
