docs/build-log/comms-matrix-1/review-bindings-mutation.diff
--- a/data/canonical-extensions/odos-comms-preference.json
+++ b/data/canonical-extensions/odos-comms-preference.json
@@ -71,11 +71,7 @@
           {
             "code": "code"
           }
-        ],
-        "binding": {
-          "strength": "required",
-          "valueSet": "https://odos2020.com/fhir/ValueSet/comms-purpose|2026-09-10"
-        }
+        ]
       },
       {
         "id": "Extension.extension:channel",
